Possible results of the partial failure from invoking the DesignToFabricationConverter.
  Namespace:   Autodesk.Revit.DB.Fabrication
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
  Since:  2017
  Since:  2017
 Syntax
  C#
public enum PartialFailureResults
  Visual Basic
Public Enumeration PartialFailureResults
  Visual C++
public enum class PartialFailureResults
 Members
  Member name  |   Description
   NotAllPartsConverted   |   Not all design elements were converted.
   InvalidConnections   |   The connections are invalid.
   HaveOpenConnectors   |   Converted fabrication parts have open ends.
   HaveDifferentOffsets   |   Converted fabrication parts have different offsets.
   NoMatchingSize   |   There are no matching sizes found.
 See Also
  Autodesk.Revit.DB.Fabrication Namespace